{
  "backend/main.mo": "Main backend actor defining state, domain types, authorization/storage mixins, and core entities such as referrals, intakes, beds, facilities, and access requests.",
  "backend/migration.mo": "Migration module containing legacy and updated type definitions (including Referral_New with staff_review_notes) used for data upgrades between versions.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected frontend files, components, and test IDs with high-confidence tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files and their roles, including new staff_review_notes UI and related query updates.",
  "frontend/DEPLOYMENT.md": "Documentation outlining prerequisites and steps for building and deploying the production frontend and backend.",
  "frontend/index.css": "Global Tailwind CSS configuration defining light/dark theme variables and base styling rules.",
  "frontend/index.html": "Base HTML entry point that loads the frontend React application via main.tsx.",
  "frontend/SMOKE_TESTS.md": "Manual production smoke test guide detailing required checks for authentication, admin access, and dashboard functionality.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile/admin fetching, route gating, and conditional rendering of dashboards and modals.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access-pending message with logout support when a user lacks approval.",
  "frontend/src/components/AccessRequestsTab.tsx": "Admin interface for viewing, approving, and deleting pending partner access requests.",
  "frontend/src/components/ActivityLogTab.tsx": "Paginated viewer for system activity logs with user lookup, formatting, and error handling.",
  "frontend/src/components/AdminBedUtilizationSummary.tsx": "Summarizes total, available, and occupied beds, including per‑program breakdowns.",
  "frontend/src/components/AdminRiskOverviewCompact.tsx": "Compact admin dashboard summarizing at‑risk referrals, intakes, and beds with navigation hooks.",
  "frontend/src/components/AdminStatusCheckCard.tsx": "Displays admin status info, handling loading and error states and listing all admin principals.",
  "frontend/src/components/BedsTab.tsx": "Provides bed management UI with filtering, assignment, editing, archiving, and deletion controlled by user actions.",
  "frontend/src/components/DashboardOverview.tsx": "Shows high-level referral, intake, and bed statistics with loading skeletons and admin utilization summary.",
  "frontend/src/components/EmploymentTab.tsx": "Empty component file with no implementation.",
  "frontend/src/components/FacilitiesTab.tsx": "Manages facilities and bed creation with validation, dialogs, and explicit user-triggered mutations only.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, theme toggle, user menu, and logout handling.",
  "frontend/src/components/IntakesDataViewTable.tsx": "Displays a sortable table of intakes with status, program, bed, and case manager info, including loading and empty states. Highlights at‑risk intakes and formats metadata.",
  "frontend/src/components/IntakesTab.tsx": "Main intake management UI handling creation, review, bed assignment, exits, notes, case managers, and toggling between management and data‑view modes. Integrates multiple dialogs, validations, and query hooks.",
  "frontend/src/components/PartnerAgencyProfileTab.tsx": "Allows partner agencies to view and edit their profile details with validation and save functionality. Loads existing data and provides form error handling and feedback.",
  "frontend/src/components/PartnerReferralsTab.tsx": "Enables partner agencies to create, view, edit, and resubmit referrals with validation and document upload. Shows referral list, statuses, and enforces agency profile completion.",
  "frontend/src/components/PlacementEmploymentTab.tsx": "Manages client employment and placement records, loading existing data and allowing updates to status, job details, notes, and weekly check‑ins. Fetches intakes and training records and saves changes via mutation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to submit basic profile info, validating inputs and saving via API. Blocks interaction while saving and provides success or error feedback.",
  "frontend/src/components/ReferralCountsSummary.tsx": "Displays total and per‑status referral counts using badges, computing counts via useMemo.",
  "frontend/src/components/ReferralsTab.tsx": "Main referrals management UI with filtering, sorting, status updates, history, and dialogs for actions.",
  "frontend/src/components/ReferralStatusBadge.tsx": "Renders a status badge with icon, label, and variant based on referral status.",
  "frontend/src/components/RequestAccessForm.tsx": "Form allowing agencies to request system access, submitting data and showing a confirmation screen.",
  "frontend/src/components/StaffMyWorkTab.tsx": "Shows intakes and referrals assigned to the logged‑in staff member, sorted by recent activity.",
  "frontend/src/components/StaffOverviewCompact.tsx": "Compact staff dashboard summarizing referrals, intakes, beds, and at‑risk items with quick navigation.",
  "frontend/src/components/StatusHistoryTimeline.tsx": "Displays a sorted timeline of referral or intake status changes with timestamps and user info.",
  "frontend/src/components/TrainingTab.tsx": "Manages client training records, including status, track selection, checklists, notes, and saving via mutations.",
  "frontend/src/components/UserManagementTab.tsx": "Lists users, shows pending and active roles, and allows assigning roles through UI controls.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity persistence using AuthClient and context.",
  "frontend/src/hooks/useNow.ts": "Provides a timestamp that updates every minute for time-sensitive UI displays.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend actions like user profiles, roles, admin checks, and various domain entities.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive CSS variables for light and dark themes plus global base styles.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with tabs for operations views like referrals, intakes, beds, facilities, and user management.",
  "frontend/src/pages/LoginPage.tsx": "Implements the login screen using Internet Identity with an option to request access and view organization info.",
  "frontend/src/pages/PartnerDashboard.tsx": "Provides partner-facing tabs for managing referrals, submitting new ones, and editing agency profiles.",
  "frontend/src/pages/PublicReferralPage.tsx": "Implements a public referral submission form with validation, mutation handling, and success confirmation.",
  "frontend/src/pages/StaffDashboard.tsx": "Displays staff dashboard with tabs for overview, work tasks, referrals, intakes, beds, training, and placement services.",
  "frontend/src/utils/atRisk.ts": "Contains utility functions to detect at-risk referrals, intakes, and beds and provides readable labels.",
  "frontend/src/utils/bedTrackingPreferences.ts": "Manages bed-tracking user preferences with load, save, clear, and default helpers using localStorage and validation.",
  "frontend/src/utils/referralFilters.ts": "Provides functions to derive program options and filter referrals by program, status, and date range with combined filtering.",
  "frontend/src/utils/referralSort.ts": "Sorts referrals by submission date or by ranked status with deterministic tie‑breakers.",
  "frontend/src/utils/referralValidation.ts": "Validates referral form fields, checks for errors, and maps backend errors to user-friendly messages.",
  "frontend/src/utils/referralWaitingTime.ts": "Calculates elapsed waiting time for referrals and formats it, with a check for exceeding a 72‑hour threshold.",
  "frontend/src/utils/sortByUpdatedAt.ts": "Sorts items by updatedAt and id for stable ordering and provides referral/intake activity sort helpers.",
  "frontend/src/utils/urlParams.ts": "Utilities to read, persist, and clear URL and session parameters, supporting hash-based routing.",
  "frontend/src/utils/userDisplay.ts": "Resolves a principal to a user-friendly display name or shortened principal fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Contains project metadata, architecture notes, and known issues summarizing the Neighbors Light system."
}