{
  "backend/main.mo": "Defines the backend actor with data models for referrals, intakes, beds, facilities, access requests, user profiles, and activity logs, including authorization and storage mixins plus state counters.",
  "backend/migration.mo": "Provides migration logic that adds a lastUpdatedBy field to existing referral and intake records by transforming old stored data into the new format.",
  "feature_evidence.json": "Lists feature evidence entries mapping UI features to affected frontend files, required components, and associated test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files describing their role in the application’s UI, routing, admin logic, and data handling.",
  "frontend/DEPLOYMENT.md": "Documentation outlining prerequisites and steps for building and deploying the application to production.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables and light/dark mode color tokens.",
  "frontend/index.html": "Basic HTML entry point loading the root React container and main script.",
  "frontend/SMOKE_TESTS.md": "Manual smoke test procedure for validating production functionality, especially admin access and authentication flows.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile fetching, admin checks, and routing users to dashboards or setup screens.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access-pending message with logout functionality for users awaiting approval.",
  "frontend/src/components/AccessRequestsTab.tsx": "Admin interface for viewing, approving, or deleting pending partner agency access requests.",
  "frontend/src/components/ActivityLogTab.tsx": "Fetches and paginates activity log entries, formatting user names, actions, and timestamps for display.",
  "frontend/src/components/AdminBedUtilizationSummary.tsx": "Shows overall and per-program bed utilization statistics, including totals and available/occupied counts.",
  "frontend/src/components/AdminRiskOverviewCompact.tsx": "Summarizes at‑risk referrals, intakes, and beds for quick admin review, with navigation to detailed tabs.",
  "frontend/src/components/AdminStatusCheckCard.tsx": "Fetches and displays admin status, handling loading and error states, and lists all admin principals.",
  "frontend/src/components/BedsTab.tsx": "Manages bed assignment, editing, filtering, and archiving with admin-specific preferences and multiple dialogs.",
  "frontend/src/components/DashboardOverview.tsx": "Shows aggregate referral, intake, and bed statistics with loading skeletons and admin-only utilization summary.",
  "frontend/src/components/FacilitiesTab.tsx": "Provides facility creation and bed addition workflows with dialogs, form validation, and active-bed limits.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays app header with logo, theme toggle, user menu, and logout handling based on profile and admin status.",
  "frontend/src/components/IntakesDataViewTable.tsx": "Displays a sortable table of intakes with status, bed info, case manager, and risk indicators, loading data from query hooks.",
  "frontend/src/components/IntakesTab.tsx": "Provides full intake management UI including creation, review, bed assignment, exiting, notes, and a toggle between management and data view modes.",
  "frontend/src/components/PartnerAgencyProfileTab.tsx": "Allows partner agencies to view and edit their agency profile with validation and save behavior via query hooks.",
  "frontend/src/components/PartnerReferralsTab.tsx": "Enables partner agencies to create, view, edit, and resubmit referrals with validation, document upload, and status display.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile setup, collecting basic contact info and submitting it through a save profile API.",
  "frontend/src/components/ReferralCountsSummary.tsx": "Computes and displays summary counts of referrals by status using badges within a card.",
  "frontend/src/components/ReferralsTab.tsx": "Displays and manages referrals with filtering, sorting, status updates, history, and admin actions.",
  "frontend/src/components/ReferralStatusBadge.tsx": "Renders a badge showing referral status with matching icon, label, and style variant.",
  "frontend/src/components/RequestAccessForm.tsx": "Provides a form for agencies to request system access and shows a confirmation screen after submission.",
  "frontend/src/components/StaffOverviewCompact.tsx": "Shows a compact staff dashboard summarizing referrals, intakes, beds, and at‑risk items with quick navigation.",
  "frontend/src/components/StatusHistoryTimeline.tsx": "Displays chronological status history entries with labels, timestamps, and user info.",
  "frontend/src/components/UserManagementTab.tsx": "Allows admins to view users, assign roles, and manage pending access requests.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useNow.ts": "Returns a timestamp that updates every minute for time‑based UI updates.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for calling backend actor methods related to admin checks, profiles, and various resource operations.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and defines light/dark theme CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard UI with tabbed navigation for managing system resources and analytics.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen using Internet Identity with an optional access request form.",
  "frontend/src/pages/PartnerDashboard.tsx": "Renders the partner dashboard with tabs for referrals, submitting new referrals, and managing the agency profile.",
  "frontend/src/pages/StaffDashboard.tsx": "Provides the staff dashboard interface with tabs for overview, referrals, intakes, and bed management.",
  "frontend/src/utils/atRisk.ts": "Contains utility functions to determine at-risk status for referrals, intakes, and beds, plus human-readable labels.",
  "frontend/src/utils/bedTrackingPreferences.ts": "Manages loading, saving, and clearing bed tracking preferences in localStorage with validation and defaults.",
  "frontend/src/utils/referralFilters.ts": "Provides filtering utilities for referrals based on program, date range, and status.",
  "frontend/src/utils/referralSort.ts": "Implements deterministic referral sorting by submission date or status with tie-breakers.",
  "frontend/src/utils/referralValidation.ts": "Validates referral form fields, checks for errors, and formats user-facing error messages.",
  "frontend/src/utils/referralWaitingTime.ts": "Calculates and formats referral waiting time and checks if a referral is overdue.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings and session storage.",
  "frontend/src/utils/userDisplay.ts": "Resolves a principal to a user-friendly display name, falling back to a truncated principal ID.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, radii, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON snapshot of the project’s state defining schema version, platform summary, and a list of implemented feature definitions with IDs, titles, and descriptions."
}