{
  "backend/main.mo": "Defines the backend actor with access control, storage mixins, and data models for referrals, intakes, beds, facilities, access requests, and activity logs.",
  "feature_evidence.json": "Lists feature evidence entries linking features to source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files for quick reference in build planning.",
  "frontend/DEPLOYMENT.md": "Production deployment checklist detailing prerequisites and steps for building and deploying the system.",
  "frontend/index.css": "Defines global Tailwind-based OKLCH color system and theme variables for light and dark mode.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/SMOKE_TESTS.md": "Manual smoke test guide outlining steps to verify a working production deployment with emphasis on admin access behavior.",
  "frontend/src/App.tsx": "Main application router handling authentication, admin detection, profile setup, and dashboard selection.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an Access Pending screen for non-admin users without assigned roles and provides a logout option.",
  "frontend/src/components/AccessRequestsTab.tsx": "Displays pending access requests and supports approving with a Principal ID or deleting requests.",
  "frontend/src/components/ActivityLogTab.tsx": "Fetches and paginates activity log entries, formatting users, actions, entities, and timestamps for display.",
  "frontend/src/components/AdminRiskOverviewCompact.tsx": "Shows a compact risk dashboard summarizing at‑risk referrals, intakes, and beds with navigation to full views.",
  "frontend/src/components/AdminStatusCheckCard.tsx": "Displays admin status, caller principal, and all admin principals with loading and error states.",
  "frontend/src/components/BedsTab.tsx": "Manages bed listing, filtering, assignment, editing, archiving, and deletion with admin-specific preferences.",
  "frontend/src/components/DashboardOverview.tsx": "Displays referral, intake, and bed statistics with loading skeletons and status helpers.",
  "frontend/src/components/FacilitiesTab.tsx": "Provides UI for managing facilities and adding beds with validation and mutation actions.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and external link.",
  "frontend/src/components/Header.tsx": "Shows app header with branding, theme toggle, user menu, and logout handling.",
  "frontend/src/components/IntakesTab.tsx": "Manages intake creation, review, bed assignment, exit processing, notes, and case manager updates.",
  "frontend/src/components/PartnerAgencyProfileTab.tsx": "Allows partner agencies to view and update their profile with validation and save actions.",
  "frontend/src/components/PartnerReferralsTab.tsx": "UI for partners to view, create, edit, and resubmit referrals, including form handling, validation, document upload, and status display.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to submit basic profile info and trigger profile creation via API.",
  "frontend/src/components/ReferralsTab.tsx": "Staff/admin view for listing, filtering, reviewing, and updating referral statuses, including messaging and internal notes.",
  "frontend/src/components/ReferralStatusBadge.tsx": "Renders a status badge with icon, label, and variant styling based on referral status.",
  "frontend/src/components/RequestAccessForm.tsx": "Form allowing agencies to request system access and shows a confirmation screen after submission.",
  "frontend/src/components/StaffOverviewCompact.tsx": "Dashboard-style summary of referrals, intakes, and beds with at‑risk indicators and navigation links.",
  "frontend/src/components/StatusHistoryTimeline.tsx": "Renders a timeline of status history entries with labels, timestamps, and user info, sorted newest first.",
  "frontend/src/components/UserManagementTab.tsx": "Displays pending and active users, allowing admins to assign roles and view user information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and logout.",
  "frontend/src/hooks/useNow.ts": "Provides a timestamp that updates every minute for UI time freshness.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, partner agency data, and other backend resources.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Initializes the app root with React Query and Internet Identity providers and loads the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard with tabbed navigation for overview, referrals, intakes, beds, facilities, access requests, user management, and activity logs.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity authentication with an option to request access and basic app information.",
  "frontend/src/pages/PartnerDashboard.tsx": "Partner dashboard providing tabs for managing referrals, submitting new ones, and editing the agency profile.",
  "frontend/src/pages/StaffDashboard.tsx": "Staff dashboard offering overview, referrals, intakes, and bed management through a tabbed interface.",
  "frontend/src/utils/atRisk.ts": "Utility functions to detect at-risk referrals, intakes, and beds and return human-readable labels.",
  "frontend/src/utils/bedTrackingPreferences.ts": "Utility for loading, saving, clearing, and defaulting user bed tracking preferences in localStorage.",
  "frontend/src/utils/referralFilters.ts": "Referral filtering utilities for program, status, and date range, plus combined filter application.",
  "frontend/src/utils/referralValidation.ts": "Validation utilities for referral form fields with error detection and user-friendly error messages.",
  "frontend/src/utils/referralWaitingTime.ts": "Functions to calculate and format referral waiting time and check if a referral is overdue.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL or hash parameters, persist them in sessionStorage, and clear them, with precedence rules for URL over stored values.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, container settings, and typography/container-query/animation plugins.",
  "project_state.json": "Project metadata describing the app’s purpose and a detailed list of implemented features for authentication, access control, roles, and workflows."
}