{
  "backend/main.mo": "Defines the backend actor with access control, storage mixins, and comprehensive data types for referrals, intakes, beds, facilities, users, and access requests.",
  "feature_evidence.json": "Provides evidence records listing required frontend changes related to adding a visible `website` field and ensuring no honeypot logic is applied.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend files, describing core components, pages, hooks, and behavior expectations.",
  "frontend/DEPLOYMENT.md": "Production deployment checklist outlining prerequisites and steps to build and deploy the application.",
  "frontend/index.css": "Global Tailwind-based style definitions setting light/dark theme variables and base styling rules.",
  "frontend/index.html": "HTML entry point that defines the root container and loads the main frontend script.",
  "frontend/SMOKE_TESTS.md": "Manual smoke test guide detailing steps to verify production functionality, especially admin access behavior.",
  "frontend/src/App.tsx": "Main React entry component handling authentication, admin checks, public referral route bypass, and conditional dashboard rendering.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access-pending screen with next steps and a logout button that clears identity and cached queries.",
  "frontend/src/components/AccessRequestsTab.tsx": "Shows pending access requests with actions to approve via principal ID or delete, including dialogs and loading states.",
  "frontend/src/components/ActivityLogTab.tsx": "Fetches and paginates activity log entries, formatting actions, entities, timestamps, and resolving user names.",
  "frontend/src/components/AdminBedUtilizationSummary.tsx": "Summarizes total, available, and occupied beds overall and by program, handling empty states.",
  "frontend/src/components/AdminRiskOverviewCompact.tsx": "Provides a compact risk overview across referrals, intakes, and beds, highlighting at‑risk and pending items with navigation.",
  "frontend/src/components/AdminStatusCheckCard.tsx": "Displays admin status info including caller principal, admin status, and list of admin principals with loading and error states.",
  "frontend/src/components/BedsTab.tsx": "Renders the full bed management UI with filtering, assignment, editing, archiving, and deletion, using query hooks and saved admin preferences. Ensures all bed mutations only occur on explicit user actions.",
  "frontend/src/components/DashboardOverview.tsx": "Displays high-level referral, intake, and bed statistics with loading skeletons and status badges. Includes admin-specific bed utilization info when applicable.",
  "frontend/src/components/EmploymentTab.tsx": "File is empty and contains no implementation.",
  "frontend/src/components/FacilitiesTab.tsx": "Provides UI to create facilities and add beds, enforcing a maximum active beds limit and performing all mutations only on user-submitted forms. Uses query hooks to load facilities and beds.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, theme toggle, user menu, and logout functionality, using profile and admin status queries. Displays initials and role based on fetched profile data.",
  "frontend/src/components/IntakesDataViewTable.tsx": "Shows a sortable table of intake records with status, program, bed info, case manager, and risk indicators. Loads intakes, beds, and users, handling loading and empty states.",
  "frontend/src/components/IntakesTab.tsx": "Manages intake creation, review, bed assignment, exits, notes, and case manager updates with multiple dialogs and data views.",
  "frontend/src/components/PartnerAgencyProfileTab.tsx": "Displays and edits a partner agency’s profile with validation and save functionality.",
  "frontend/src/components/PartnerReferralsTab.tsx": "Handles listing, creating, editing, resubmitting, and uploading documents for partner referrals with validation.",
  "frontend/src/components/PlacementEmploymentTab.tsx": "Loads and updates client employment placement records, including weekly check-ins and status details.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to submit basic profile details for access approval.",
  "frontend/src/components/ReferralCountsSummary.tsx": "Calculates and displays referral counts by status in a summary card.",
  "frontend/src/components/ReferralsTab.tsx": "Displays and manages referrals with filtering, sorting, status updates, messaging, and detail dialogs.",
  "frontend/src/components/ReferralStatusBadge.tsx": "Renders a badge showing referral status with an icon, label, and variant based on status.",
  "frontend/src/components/RequestAccessForm.tsx": "Form for creating an access request with validation, submission handling, and a success confirmation screen.",
  "frontend/src/components/StaffMyWorkTab.tsx": "Shows intakes and referrals assigned to the logged‑in user, sorted by recent activity with loading and empty states.",
  "frontend/src/components/StaffOverviewCompact.tsx": "Provides a compact dashboard of referrals, intakes, and beds including at‑risk indicators and navigation shortcuts.",
  "frontend/src/components/StatusHistoryTimeline.tsx": "Displays a chronological timeline of status changes with timestamps, labels, variants, and user attribution.",
  "frontend/src/components/TrainingTab.tsx": "Renders a training management UI allowing staff to select a client, load their training record, update status and checklists, and save changes via React Query mutations.",
  "frontend/src/components/UserManagementTab.tsx": "Displays user accounts, lets admins assign roles to pending users, and shows role badges with loading and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, initializing admin access when available and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and logic using Internet Identity, exposing login, logout, and identity context throughout the app.",
  "frontend/src/hooks/useNow.ts": "Returns the current timestamp and updates it every minute for time‑based UI refreshes.",
  "frontend/src/hooks/useQueries.ts": "Defines a wide set of React Query hooks that call backend actor methods for admin checks, user profiles, partner profiles, training records, and more.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes, including color tokens and layout defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard with tabbed navigation for overview, referrals, intakes, beds, facilities, access requests, user management, and activity logs.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity with an option to request access and a brief description of the platform.",
  "frontend/src/pages/PartnerDashboard.tsx": "Partner dashboard providing tabs for viewing referrals, submitting new referrals, and managing the agency profile.",
  "frontend/src/pages/PublicReferralPage.tsx": "Public referral submission form with validation, checkbox confirmation, and success handling.",
  "frontend/src/pages/StaffDashboard.tsx": "Staff dashboard with tabs for overview, work items, referrals, intakes, beds, training, and placement/employment tasks.",
  "frontend/src/utils/atRisk.ts": "Utility functions to determine at‑risk status for referrals, intakes, and beds, plus human‑readable labels.",
  "frontend/src/utils/bedTrackingPreferences.ts": "LocalStorage-backed load/save utilities for bed tracking filter preferences with defaults and validation.",
  "frontend/src/utils/referralFilters.ts": "Provides helpers to derive unique program options and filter referrals by program, status, and date range.",
  "frontend/src/utils/referralSort.ts": "Implements deterministic referral sorting by submission date or status with tie-breakers.",
  "frontend/src/utils/referralValidation.ts": "Validates referral form fields, reports missing data, and provides generic error message helpers.",
  "frontend/src/utils/referralWaitingTime.ts": "Calculates elapsed wait time from createdAt and formats or flags overdue referrals.",
  "frontend/src/utils/sortByUpdatedAt.ts": "Sorts items by updatedAt with id tie-breakers and exposes helpers for referrals and intakes.",
  "frontend/src/utils/urlParams.ts": "Manages URL and session-stored parameters, including retrieval, persistence, and hash cleanup.",
  "frontend/src/utils/userDisplay.ts": "Resolves a principal to a display name or shortened identifier.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and layout with typography and container query plugins.",
  "project_state.json": "Metadata describing the project’s architecture, features, and known issues for Neighbors Light."
}