{
  "backend/main.mo": "Defines backend actor with authorization, storage mixins, and data types for referrals, intakes, beds, facilities, access requests, and placement records.",
  "feature_evidence.json": "Feature evidence report documenting UI reordering work on ReferralsTab and associated components and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of various frontend components, hooks, and pages.",
  "frontend/DEPLOYMENT.md": "Production deployment checklist detailing prerequisites and steps for building and deploying the app.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light and dark themes and applying base styles.",
  "frontend/index.html": "HTML entrypoint loading the React app via main.tsx with a root div.",
  "frontend/SMOKE_TESTS.md": "Smoke test procedure describing manual verification steps for login, admin access, and UI health in production.",
  "frontend/src/App.tsx": "Root React component handling authentication, role-based routing, public referral route, and initial profile/admin checks.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen for users awaiting access approval with logout option and informational guidance.",
  "frontend/src/components/AccessRequestsTab.tsx": "Displays pending access requests, allowing admins to approve them by assigning a principal or delete them.",
  "frontend/src/components/ActivityLogTab.tsx": "Fetches and paginates activity log entries, formatting actions, entities, and user names for display in a table.",
  "frontend/src/components/AdminBedUtilizationSummary.tsx": "Shows total, available, and occupied beds, including per-program breakdowns.",
  "frontend/src/components/AdminRiskOverviewCompact.tsx": "Provides a compact admin dashboard summarizing at‑risk referrals, intakes, and beds with quick navigation.",
  "frontend/src/components/AdminStatusCheckCard.tsx": "Displays admin status info, including caller principal, admin flag, and full admin principal list with loading and error states.",
  "frontend/src/components/BedsTab.tsx": "Renders bed management UI with filtering, assignment, editing, and admin-only persistence of preferences; triggers bed mutations only on explicit user actions.",
  "frontend/src/components/DashboardOverview.tsx": "Displays referral, intake, and bed statistics with loading skeletons and status badges, optionally including admin bed utilization data.",
  "frontend/src/components/EmploymentTab.tsx": "Empty placeholder file with no implemented UI or logic.",
  "frontend/src/components/FacilitiesTab.tsx": "Provides facility creation and bed addition interfaces with validation, capacity checks, and explicit user-triggered mutations.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header showing app branding, theme toggle, user info dropdown, and logout handling with identity and cache clearing.",
  "frontend/src/components/IntakesDataViewTable.tsx": "Renders sortable intake table with status, program, bed assignment, and risk indicators, fetching intakes, beds, and users.",
  "frontend/src/components/IntakesTab.tsx": "Manages intake creation, review, bed assignment, exit processing, internal notes, and case manager assignment with multiple dialogs and data views.",
  "frontend/src/components/PartnerAgencyProfileTab.tsx": "Displays and edits the partner agency’s profile with validation and save functionality.",
  "frontend/src/components/PartnerReferralsTab.tsx": "Handles listing, creating, editing, resubmitting, and document uploading for partner agency referrals.",
  "frontend/src/components/PlacementEmploymentTab.tsx": "Allows staff to view and update client employment placement and weekly check-in data.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to submit basic profile info for admin approval.",
  "frontend/src/components/ReferralCountsSummary.tsx": "Computes and displays referral status counts in a compact summary card.",
  "frontend/src/components/ReferralsTab.tsx": "Main referrals management UI with filtering, sorting, status updates, history viewing, and review actions.",
  "frontend/src/components/ReferralStatusBadge.tsx": "Displays a status badge for a referral with an icon, label, and style variant based on status.",
  "frontend/src/components/RequestAccessForm.tsx": "Form for users to submit an access request and shows a confirmation screen after submission.",
  "frontend/src/components/StaffMyWorkTab.tsx": "Shows intakes and referrals assigned to the logged‑in staff member, sorted by recent activity.",
  "frontend/src/components/StaffOverviewCompact.tsx": "Provides a compact dashboard of referral, intake, and bed statuses, including at‑risk counts and quick navigation.",
  "frontend/src/components/StatusHistoryTimeline.tsx": "Renders a chronological timeline of status history entries for referrals or intakes with timestamps and user info.",
  "frontend/src/components/TrainingTab.tsx": "Renders a training management interface letting staff load a client's training record, edit status, track, checklists, and notes, and save updates through backend mutations.",
  "frontend/src/components/UserManagementTab.tsx": "Displays all users, separates pending and active users, and allows assigning roles through backend mutations with visual badges.",
  "frontend/src/hooks/useActor.ts": "Creates and maintains a backend actor tied to the authenticated identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication via Internet Identity, exposing identity state, login, logout, and status, and initializes AuthClient with customized behavior.",
  "frontend/src/hooks/useNow.ts": "Returns a timestamp that updates every minute to support UI time refreshes.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks wrapping backend actor calls for user, admin, partner agency, training, and other data operations.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for light and dark themes and global UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders an admin dashboard with tabbed navigation for oversight of referrals, intakes, beds, facilities, access requests, users, and activity logs.",
  "frontend/src/pages/LoginPage.tsx": "Provides login via Internet Identity and an option to request access, with a branded card-based UI.",
  "frontend/src/pages/PartnerDashboard.tsx": "Displays a partner dashboard with tabs for viewing referrals, submitting new ones, and managing agency profile.",
  "frontend/src/pages/PublicReferralPage.tsx": "Implements a public referral submission form with validation, checkbox confirmation, API submission, and success handling.",
  "frontend/src/pages/StaffDashboard.tsx": "Shows a staff dashboard with tabs for overview, work items, referrals, intakes, beds, training, and placement.",
  "frontend/src/utils/atRisk.ts": "Contains utility functions to detect at‑risk referrals, intakes, and beds based on timestamps and assignment state.",
  "frontend/src/utils/bedTrackingPreferences.ts": "Handles loading, validating, saving, and clearing bed‑tracking user preferences in localStorage.",
  "frontend/src/utils/referralFilters.ts": "Provides utility functions to build program filter options and filter referrals by program, status, and date range.",
  "frontend/src/utils/referralSort.ts": "Sorts referrals by status or submission date with deterministic tie-breakers using creation time and ID.",
  "frontend/src/utils/referralValidation.ts": "Validates referral form fields and generates error messages, plus helpers to check and interpret validation errors.",
  "frontend/src/utils/referralWaitingTime.ts": "Calculates elapsed time since referral creation and formats waiting-time strings, including an overdue check.",
  "frontend/src/utils/sortByUpdatedAt.ts": "Sorts items by updatedAt descending with ID tie-breakers, with helpers for referrals and intakes.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/userDisplay.ts": "Resolves a principal to a display name, falling back to a shortened principal or 'System'.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, animations, container settings, and plugin setup.",
  "project_state.json": "Describes the project's current architecture, features, and known issues for Neighbors Light."
}