{
  "backend/main.mo": "Defines backend actor with access control, storage mixins, and rich data types for referrals, intakes, beds, facilities, users, and status tracking.",
  "feature_evidence.json": "Specifies feature evidence for updating the public referral form's website field layout in PublicReferralPage.tsx.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend files including routing, dashboards, components, and hooks.",
  "frontend/DEPLOYMENT.md": "Outlines production deployment prerequisites and steps for the frontend and backend.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entrypoint mounting the React app via main.tsx.",
  "frontend/SMOKE_TESTS.md": "Provides manual smoke test procedures for validating production function, especially admin access behavior.",
  "frontend/src/App.tsx": "Main app component handling auth flow, admin checks, profile setup, public referral routing, and dashboard selection.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown to users awaiting approval with logout and guidance information.",
  "frontend/src/components/AccessRequestsTab.tsx": "Displays and manages pending access requests, allowing admins to approve with a principal ID or delete requests.",
  "frontend/src/components/ActivityLogTab.tsx": "Fetches and paginates activity log entries, formatting user, action, and entity data for display.",
  "frontend/src/components/AdminBedUtilizationSummary.tsx": "Summarizes total, available, and occupied beds, including per‑program breakdowns.",
  "frontend/src/components/AdminRiskOverviewCompact.tsx": "Shows a compact dashboard of at‑risk referrals, intakes, and beds, with navigation to detailed tabs.",
  "frontend/src/components/AdminStatusCheckCard.tsx": "Displays admin status, principal info, and list of all admin principals with loading and error states.",
  "frontend/src/components/BedsTab.tsx": "UI for viewing, filtering, assigning, editing, archiving, and deleting beds, with admin-specific preferences persisted to localStorage.",
  "frontend/src/components/DashboardOverview.tsx": "Displays referral, intake, and bed statistics with loading states and status badges, plus optional admin bed utilization data.",
  "frontend/src/components/EmploymentTab.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/FacilitiesTab.tsx": "Manages facilities and bed creation, providing forms for adding facilities and beds with validation and max-bed limits.",
  "frontend/src/components/Footer.tsx": "Static footer displaying attribution text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with branding, user info, theme toggle, and logout handling using identity and profile queries.",
  "frontend/src/components/IntakesDataViewTable.tsx": "Displays a sortable intakes table with status, bed info, case manager data, and at-risk indicators.",
  "frontend/src/components/IntakesTab.tsx": "Manages intake creation, review, bed assignment, exit processing, notes, and status history with admin controls and data-view mode.",
  "frontend/src/components/PartnerAgencyProfileTab.tsx": "Displays and edits a partner agency's profile with validation and save handling.",
  "frontend/src/components/PartnerReferralsTab.tsx": "Handles creating, listing, editing, and resubmitting partner referrals with validation and document upload.",
  "frontend/src/components/PlacementEmploymentTab.tsx": "Allows staff to view and update a client's employment placement record, including status, employer details, and weekly check-ins.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to submit basic profile details before receiving access approval.",
  "frontend/src/components/ReferralCountsSummary.tsx": "Computes and displays summary counts of referrals grouped by status.",
  "frontend/src/components/ReferralsTab.tsx": "Displays and manages referrals with filtering, sorting, status updates, history viewing, and admin actions. Includes dialogs, notes, request‑info workflow, and various referral utilities.",
  "frontend/src/components/ReferralStatusBadge.tsx": "Renders a status badge with an icon, label, and variant based on referral status. Provides helper functions to map statuses to icons, variants, and labels.",
  "frontend/src/components/RequestAccessForm.tsx": "Form for creating an access request, validating fields, and submitting through a query hook. Shows a confirmation screen after successful submission.",
  "frontend/src/components/StaffMyWorkTab.tsx": "Shows intakes and referrals assigned to the logged‑in staff member, sorted by recent activity. Includes loading states, empty states, and date formatting helpers.",
  "frontend/src/components/StaffOverviewCompact.tsx": "Compact staff dashboard summarizing referrals, intakes, and beds, including at‑risk items and navigation links. Computes several warning groups and availability counts.",
  "frontend/src/components/StatusHistoryTimeline.tsx": "Displays a chronological status history with labels, timestamps, and user info for referrals or intakes. Sorts entries newest‑first and formats variants and timestamps.",
  "frontend/src/components/TrainingTab.tsx": "Provides a UI for selecting a client and editing their training record, including status, track, checklists, and notes with save functionality.",
  "frontend/src/components/UserManagementTab.tsx": "Displays all users, separates pending and active users, and allows assigning roles via UI controls and mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, auto-refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, handling login, stored identities, and exposing identity state.",
  "frontend/src/hooks/useNow.ts": "Provides a timestamp that updates every minute for time‑sensitive UI displays.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for user profiles, roles, partner agencies, admin checks, and various records.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes across the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard with tabbed navigation for overview, referrals, intakes, beds, facilities, access requests, users, and activity.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity with optional access request form and informational section.",
  "frontend/src/pages/PartnerDashboard.tsx": "Partner dashboard providing tabs for referral list, referral submission, and agency profile management.",
  "frontend/src/pages/PublicReferralPage.tsx": "Public referral submission form with validation, checkbox confirmation, and success state handling.",
  "frontend/src/pages/StaffDashboard.tsx": "Staff dashboard with tabs for overview, work tasks, referrals, intakes, beds, training, and placement.",
  "frontend/src/utils/atRisk.ts": "Utility functions determining at‑risk status for referrals, intakes, and beds, plus corresponding label helpers.",
  "frontend/src/utils/bedTrackingPreferences.ts": "LocalStorage-based load/save helpers for bed tracking preferences with validation and default fallbacks.",
  "frontend/src/utils/referralFilters.ts": "Provides utilities to derive unique program names and filter referrals by program, status, and submission date.",
  "frontend/src/utils/referralSort.ts": "Sorts referrals by submission date or status with deterministic tie‑breakers.",
  "frontend/src/utils/referralValidation.ts": "Validates referral form fields, detects missing data, and formats user‑friendly error messages.",
  "frontend/src/utils/referralWaitingTime.ts": "Calculates elapsed time since referral creation, formats waiting time, and checks if a referral is overdue.",
  "frontend/src/utils/sortByUpdatedAt.ts": "Sorts items by updatedAt with id tie‑breaking and provides helpers for referrals and intakes.",
  "frontend/src/utils/urlParams.ts": "Manages URL and session‑stored parameters, including parsing, persistence, and cleanup helpers.",
  "frontend/src/utils/userDisplay.ts": "Resolves a principal to a display name using user records or a shortened principal fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theming, color tokens, animations, and plugin setup.",
  "project_state.json": "Describes the project’s current architecture, features, and known issues for Neighbors Light."
}