{
  "backend/main.mo": "Defines the backend actor with user access control, referrals, intakes, beds, facilities, activity logging, and associated data models and state tracking.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Collection of pre-written summaries describing key frontend components, pages, and hooks.",
  "frontend/DEPLOYMENT.md": "Production deployment checklist covering prerequisites and backend-first deployment steps.",
  "frontend/index.css": "Global Tailwind-based style definitions using OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the frontend app and loading main.tsx.",
  "frontend/SMOKE_TESTS.md": "Manual production smoke test procedures focusing on authentication, admin access, and verifying no Access Pending lockouts.",
  "frontend/src/App.tsx": "Main app component handling authentication, admin detection, profile setup, and routing to admin, staff, or partner dashboards.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access Pending screen shown to non-admin users without assigned roles, with logout functionality.",
  "frontend/src/components/AccessRequestsTab.tsx": "Displays pending access requests, allowing admins to approve with a principal ID or delete them, with dialogs and loading states.",
  "frontend/src/components/ActivityLogTab.tsx": "Fetches and paginates activity log entries, formatting actions, entities, and timestamps while displaying user names when available.",
  "frontend/src/components/AdminRiskOverviewCompact.tsx": "Provides a compact dashboard summarizing at‑risk referrals, intakes, and beds, with counts and navigation to detailed tabs.",
  "frontend/src/components/AdminStatusCheckCard.tsx": "Shows admin status, caller principal, and list of admin principals with loading and error handling.",
  "frontend/src/components/BedsTab.tsx": "Manages bed assignment, editing, filtering, and archiving with local preference storage and risk indicators for beds.",
  "frontend/src/components/DashboardOverview.tsx": "Fetches referrals, intakes, and beds, computes aggregate stats, and displays them in dashboard cards with loading skeletons.",
  "frontend/src/components/FacilitiesTab.tsx": "Provides facility and bed management including creating facilities and adding beds with validation and dialogs.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and external link credit.",
  "frontend/src/components/Header.tsx": "Displays the app header with logo, theme toggle, user menu, and logout handling.",
  "frontend/src/components/IntakesTab.tsx": "Manages intake creation, review, bed assignment, case manager assignment, status history, and exit workflows.",
  "frontend/src/components/PartnerAgencyProfileTab.tsx": "Loads and edits partner agency profile information with validation and save functionality.",
  "frontend/src/components/PartnerReferralsTab.tsx": "Manages partner-agency referral creation, editing, file upload, and lists existing referrals with validation and status display.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to submit basic profile info and trigger profile creation via API.",
  "frontend/src/components/ReferralsTab.tsx": "Admin/staff referral management UI for viewing, filtering, updating statuses, requesting info, and reviewing history.",
  "frontend/src/components/ReferralStatusBadge.tsx": "Shows a referral status badge with icon, label, and variant styling based on status value.",
  "frontend/src/components/RequestAccessForm.tsx": "Form for agencies to submit access requests with required contact details and a confirmation screen.",
  "frontend/src/components/StaffOverviewCompact.tsx": "Dashboard-style summary of referrals, intakes, and beds with at‑risk indicators and navigation links.",
  "frontend/src/components/StatusHistoryTimeline.tsx": "Renders a timeline of status history entries with labels, timestamps, and user info, sorting entries newest first.",
  "frontend/src/components/UserManagementTab.tsx": "Displays all users, separates pending and active users, and allows assigning roles with mutations and badges.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, including login handling, stored identity loading, and status tracking.",
  "frontend/src/hooks/useNow.ts": "Returns a timestamp that auto-updates every minute for time-sensitive UI displays.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks wrapping backend actor calls for admin checks, user profiles, partner agencies, and more.",
  "frontend/src/index.css": "Tailwind base/theme definitions including light/dark color variables and global styles.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard with tabbed navigation for managing referrals, intakes, beds, facilities, users, access requests, and activity logs.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity with an option to request access and a branded info section.",
  "frontend/src/pages/PartnerDashboard.tsx": "Partner dashboard with tabs for viewing referrals, submitting new referrals, and managing agency profiles.",
  "frontend/src/pages/StaffDashboard.tsx": "Staff dashboard providing tabs for overview, referrals, intakes, and bed management.",
  "frontend/src/utils/atRisk.ts": "Utilities for detecting at‑risk referrals, intakes, and beds, plus functions returning human‑readable risk labels.",
  "frontend/src/utils/bedTrackingPreferences.ts": "LocalStorage-backed load/save utilities for managing bed tracking filter preferences with validation and defaults.",
  "frontend/src/utils/referralValidation.ts": "Shared referral form validation functions, error helpers, and simple error message mapping.",
  "frontend/src/utils/referralWaitingTime.ts": "Helpers for calculating elapsed referral time, formatting waiting time, and checking if referrals are overdue.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash params, persist them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and container settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Captures the project’s schema version and a detailed summary of features for an IC-based operations platform, including authentication, access control, roles, and workflow management."
}