{
  "kind": "build_request",
  "title": "Adjust public referral website field label, helper text, and spacing",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-80",
      "text": "Update the public (no-login) referral submission form layout in `frontend/src/pages/PublicReferralPage.tsx` for the existing website field (use `website` if present; otherwise apply the same changes to `company_website` if that is the field that exists): set the field label text to exactly “Website (leave blank)”, add helper text directly below the input that reads exactly “Please leave this field empty.”, and add extra vertical spacing above this field so it is visually separated from the main referral questions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Update the public Referral form layout.\n\nFor the field:\n- company_website (or website, whichever exists)\n\nChange the label text to:\n“Website (leave blank)”\n\nAdd helper text below the field:\n“Please leave this field empty.”\n\nAdd extra spacing above this field so it appears separated from the main referral questions.\n\nDo not change validation, logic, or behavior."
        ]
      },
      "acceptanceCriteria": [
        "On `/public/referral`, the website field label is exactly “Website (leave blank)” (English).",
        "A helper text line appears immediately below the website input and reads exactly “Please leave this field empty.” (English).",
        "There is noticeably more spacing above the website field compared to the spacing between the main referral questions (i.e., it is visually separated).",
        "No referral form validation rules, submit handler logic, or submission behavior changes (the referral creation flow remains exactly as it is today)."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text changed/added by this request.",
    "Do not change validation, submit logic, or any behavioral flow related to referral submission; this is a layout/content-only change.",
    "Make changes only in the public referral form UI (no backend changes)."
  ],
  "nonGoals": [
    "Adding new fields to the public referral form.",
    "Changing any backend types, schemas, canister methods, or stored referral data.",
    "Adding/altering any spam prevention or honeypot logic tied to the website/company_website field."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}