{
  "kind": "build_request",
  "title": "Simplify public referral spam honeypot to a visible, non-blocking Website field",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-78",
      "text": "Update the public (no-login) referral submission page at `frontend/src/pages/PublicReferralPage.tsx` to include a single, normal (visible) text input field named `website`, labeled exactly “Website (leave blank)”, placed at the bottom of the form (below all existing fields and above the submit button or directly above the footer area within the form). The field must be visually unobtrusive (e.g., small/secondary styling consistent with the existing Tailwind + shadcn form look), but it must remain a standard visible form field.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Keep a single text field named:\n- website\n\nShow it as a normal field but make it visually unobtrusive:\n- label it “Website (leave blank)”\n- place it at the bottom of the form"
        ]
      },
      "acceptanceCriteria": [
        "The public referral form renders a visible text input with `id=\"website\"` and label text exactly “Website (leave blank)”",
        "The `website` input appears at the bottom of the form (after existing fields) and is visually unobtrusive while still readable/usable",
        "No other honeypot/spam fields are present on this page"
      ]
    },
    {
      "id": "REQ-79",
      "text": "Remove/avoid any honeypot behavior tied to the `website` field on the public referral form: do not hide the field, do not block submission, do not ignore submissions, and do not add any conditional logic based on `website` (including trim checks). Submitting the form must always follow the existing `useCreateReferral` / `actor.createReferral` mutation flow exactly as it does today.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Do not add any hidden behavior and do not reject submissions.\nDo not add any conditional logic."
        ]
      },
      "acceptanceCriteria": [
        "Filling or not filling the `website` field does not change validation behavior or submission behavior",
        "`handleSubmit` does not contain any conditional checks that branch on `website` content (no rejection/early return/skip-mutation logic based on `website`)",
        "The referral creation mutation is still called on valid submissions regardless of `website` value",
        "The `website` value is not required and does not create validation errors"
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "Do not change backend schemas, backend methods, or backend validation for this request.",
    "Do not alter any existing public referral form fields or the referral submission payload/behavior besides adding the visible `website` field as specified.",
    "Do not implement hidden fields, CSS-hidden fields, offscreen positioning, or anti-bot conditional logic for `website`."
  ],
  "nonGoals": [
    "Adding spam detection, rate limiting, captchas, or any other anti-abuse mechanisms.",
    "Persisting `website` to the backend referral record or including it in the `createReferral` payload.",
    "Changing the required checkbox (`referral_partner_confirm`) behavior or validation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}