{
  "kind": "build_request",
  "title": "Add status, program, and submission date range filters to Admin Referrals Data View",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-34",
      "text": "In the Admin Referrals Data View (current referrals queue UI), add filter controls for: (1) Status, (2) Program requested, and (3) Submission date range. Filters must be combinable (AND logic) and must update the visible referrals list immediately on change.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add filters to the Admin Referrals Data View:\n- Status\n- Program requested\n- Submission date range"
        ]
      },
      "acceptanceCriteria": [
        "A user can filter referrals by Status (including an 'All' option).",
        "A user can filter referrals by Program requested (including an 'All programs' option).",
        "A user can filter referrals by a submission date range using start date and end date inputs.",
        "When multiple filters are set, only referrals matching all selected filters are shown.",
        "Changing any filter updates the list without requiring a page refresh."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Implement the 'Program requested' filter options by deriving a unique, sorted list of programRequested values from the currently loaded referrals data, and include an explicit 'All programs' option.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "Program filter options reflect the data present in the fetched referrals list.",
        "Selecting a specific program shows only referrals whose programRequested exactly matches the selected option."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Implement the 'Submission date range' filter using referral.createdAt as the submission timestamp, with inclusive boundaries for the selected start and end dates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ]
      },
      "acceptanceCriteria": [
        "If only a start date is set, referrals submitted on/after that date are shown.",
        "If only an end date is set, referrals submitted on/before that date are shown.",
        "If both are set, referrals submitted between them (inclusive) are shown.",
        "If the selected date range excludes all referrals, the UI shows the existing empty-state behavior for the filtered result."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx.",
    "Respect the single-actor backend architecture; no new backend canisters/services."
  ],
  "nonGoals": [
    "Do not add new backend endpoints for server-side referral filtering as part of this change.",
    "Do not change the referral status workflow or existing referral data schema.",
    "Do not implement CSV export functionality as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}